; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-22)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city6)
	(fuel-level plane1 fl6)
	(at plane2 city9)
	(fuel-level plane2 fl1)
	(at plane3 city1)
	(fuel-level plane3 fl2)
	(at plane4 city1)
	(fuel-level plane4 fl1)
	(at plane5 city4)
	(fuel-level plane5 fl6)
	(at plane6 city10)
	(fuel-level plane6 fl2)
	(at plane7 city4)
	(fuel-level plane7 fl4)
	(at person1 city5)
	(at person2 city4)
	(at person3 city10)
	(at person4 city10)
	(at person5 city3)
	(at person6 city8)
	(at person7 city3)
	(at person8 city8)
	(at person9 city3)
	(at person10 city8)
	(at person11 city3)
	(at person12 city10)
	(at person13 city3)
	(at person14 city10)
	(at person15 city4)
	(at person16 city0)
	(at person17 city4)
	(at person18 city2)
	(at person19 city8)
	(at person20 city2)
	(at person21 city1)
	(at person22 city5)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city4)
	(at plane3 city5)
	(at plane6 city7)
	(at person1 city5)
	(at person2 city9)
	(at person3 city4)
	(at person4 city1)
	(at person5 city7)
	(at person6 city6)
	(at person7 city4)
	(at person8 city4)
	(at person9 city8)
	(at person10 city6)
	(at person11 city0)
	(at person12 city4)
	(at person13 city4)
	(at person14 city4)
	(at person15 city7)
	(at person16 city5)
	(at person17 city8)
	(at person18 city6)
	(at person19 city9)
	(at person20 city6)
	(at person21 city10)
	(at person22 city10)
	))

)

; plan
1. (fly plane7 city4 city0 fl4 fl3)
   deleted: (at plane7 city4) (fuel-level plane7 fl4)
   added: (at plane7 city0) (fuel-level plane7 fl3)
   goals met: 1 of 25
2. (board person16 plane7 city0)
   deleted: (at person16 city0)
   added: (in person16 plane7)
   goals met: 1 of 25
3. (zoom plane7 city0 city5 fl3 fl2 fl1)
   deleted: (at plane7 city0) (fuel-level plane7 fl3)
   added: (at plane7 city5) (fuel-level plane7 fl1)
   goals met: 1 of 25
4. (board person22 plane7 city5)
   deleted: (at person22 city5)
   added: (in person22 plane7)
   goals met: 1 of 25
5. (debark person16 plane7 city5)
   deleted: (in person16 plane7)
   added: (at person16 city5)
   goals met: 2 of 25
6. (fly plane7 city5 city10 fl1 fl0)
   deleted: (at plane7 city5) (fuel-level plane7 fl1)
   added: (at plane7 city10) (fuel-level plane7 fl0)
   goals met: 2 of 25
7. (debark person22 plane7 city10)
   deleted: (in person22 plane7)
   added: (at person22 city10)
   goals met: 3 of 25
8. (board person4 plane6 city10)
   deleted: (at person4 city10)
   added: (in person4 plane6)
   goals met: 3 of 25
9. (board person3 plane6 city10)
   deleted: (at person3 city10)
   added: (in person3 plane6)
   goals met: 3 of 25
10. (board person14 plane6 city10)
   deleted: (at person14 city10)
   added: (in person14 plane6)
   goals met: 3 of 25
11. (board person12 plane6 city10)
   deleted: (at person12 city10)
   added: (in person12 plane6)
   goals met: 3 of 25
12. (zoom plane6 city10 city4 fl2 fl1 fl0)
   deleted: (at plane6 city10) (fuel-level plane6 fl2)
   added: (at plane6 city4) (fuel-level plane6 fl0)
   goals met: 3 of 25
13. (refuel plane6 city4 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 3 of 25
14. (debark person3 plane6 city4)
   deleted: (in person3 plane6)
   added: (at person3 city4)
   goals met: 4 of 25
15. (board person2 plane6 city4)
   deleted: (at person2 city4)
   added: (in person2 plane6)
   goals met: 4 of 25
16. (board person17 plane6 city4)
   deleted: (at person17 city4)
   added: (in person17 plane6)
   goals met: 4 of 25
17. (board person15 plane6 city4)
   deleted: (at person15 city4)
   added: (in person15 plane6)
   goals met: 4 of 25
18. (debark person14 plane6 city4)
   deleted: (in person14 plane6)
   added: (at person14 city4)
   goals met: 5 of 25
19. (debark person12 plane6 city4)
   deleted: (in person12 plane6)
   added: (at person12 city4)
   goals met: 6 of 25
20. (zoom plane3 city1 city5 fl2 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl2)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 7 of 25
21. (board person21 plane4 city1)
   deleted: (at person21 city1)
   added: (in person21 plane4)
   goals met: 7 of 25
22. (fly plane4 city1 city10 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 7 of 25
23. (debark person21 plane4 city10)
   deleted: (in person21 plane4)
   added: (at person21 city10)
   goals met: 8 of 25
24. (zoom plane1 city6 city4 fl6 fl5 fl4)
   deleted: (at plane1 city6) (fuel-level plane1 fl6)
   added: (at plane1 city4) (fuel-level plane1 fl4)
   goals met: 9 of 25
25. (fly plane6 city4 city7 fl1 fl0)
   deleted: (at plane6 city4) (fuel-level plane6 fl1)
   added: (at plane6 city7) (fuel-level plane6 fl0)
   goals met: 10 of 25
26. (refuel plane6 city7 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 10 of 25
27. (debark person15 plane6 city7)
   deleted: (in person15 plane6)
   added: (at person15 city7)
   goals met: 11 of 25
28. (zoom plane1 city4 city2 fl4 fl3 fl2)
   deleted: (at plane1 city4) (fuel-level plane1 fl4)
   added: (at plane1 city2) (fuel-level plane1 fl2)
   goals met: 10 of 25
29. (board person20 plane1 city2)
   deleted: (at person20 city2)
   added: (in person20 plane1)
   goals met: 10 of 25
30. (board person18 plane1 city2)
   deleted: (at person18 city2)
   added: (in person18 plane1)
   goals met: 10 of 25
31. (zoom plane1 city2 city6 fl2 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl2)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 10 of 25
32. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 25
33. (debark person20 plane1 city6)
   deleted: (in person20 plane1)
   added: (at person20 city6)
   goals met: 11 of 25
34. (debark person18 plane1 city6)
   deleted: (in person18 plane1)
   added: (at person18 city6)
   goals met: 12 of 25
35. (fly plane1 city6 city4 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 13 of 25
36. (fly plane2 city9 city3 fl1 fl0)
   deleted: (at plane2 city9) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 13 of 25
37. (zoom plane5 city4 city8 fl6 fl5 fl4)
   deleted: (at plane5 city4) (fuel-level plane5 fl6)
   added: (at plane5 city8) (fuel-level plane5 fl4)
   goals met: 13 of 25
38. (board person8 plane5 city8)
   deleted: (at person8 city8)
   added: (in person8 plane5)
   goals met: 13 of 25
39. (board person6 plane5 city8)
   deleted: (at person6 city8)
   added: (in person6 plane5)
   goals met: 13 of 25
40. (board person19 plane5 city8)
   deleted: (at person19 city8)
   added: (in person19 plane5)
   goals met: 13 of 25
41. (board person10 plane5 city8)
   deleted: (at person10 city8)
   added: (in person10 plane5)
   goals met: 13 of 25
42. (zoom plane5 city8 city4 fl4 fl3 fl2)
   deleted: (at plane5 city8) (fuel-level plane5 fl4)
   added: (at plane5 city4) (fuel-level plane5 fl2)
   goals met: 13 of 25
43. (debark person8 plane5 city4)
   deleted: (in person8 plane5)
   added: (at person8 city4)
   goals met: 14 of 25
44. (zoom plane5 city4 city6 fl2 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl2)
   added: (at plane5 city6) (fuel-level plane5 fl0)
   goals met: 14 of 25
45. (refuel plane5 city6 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 14 of 25
46. (debark person6 plane5 city6)
   deleted: (in person6 plane5)
   added: (at person6 city6)
   goals met: 15 of 25
47. (debark person10 plane5 city6)
   deleted: (in person10 plane5)
   added: (at person10 city6)
   goals met: 16 of 25
48. (fly plane5 city6 city9 fl1 fl0)
   deleted: (at plane5 city6) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 16 of 25
49. (debark person19 plane5 city9)
   deleted: (in person19 plane5)
   added: (at person19 city9)
   goals met: 17 of 25
50. (board person9 plane2 city3)
   deleted: (at person9 city3)
   added: (in person9 plane2)
   goals met: 17 of 25
51. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 25
52. (board person7 plane2 city3)
   deleted: (at person7 city3)
   added: (in person7 plane2)
   goals met: 17 of 25
53. (board person5 plane2 city3)
   deleted: (at person5 city3)
   added: (in person5 plane2)
   goals met: 17 of 25
54. (board person13 plane2 city3)
   deleted: (at person13 city3)
   added: (in person13 plane2)
   goals met: 17 of 25
55. (board person11 plane2 city3)
   deleted: (at person11 city3)
   added: (in person11 plane2)
   goals met: 17 of 25
56. (fly plane2 city3 city4 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 17 of 25
57. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 25
58. (debark person7 plane2 city4)
   deleted: (in person7 plane2)
   added: (at person7 city4)
   goals met: 18 of 25
59. (debark person13 plane2 city4)
   deleted: (in person13 plane2)
   added: (at person13 city4)
   goals met: 19 of 25
60. (fly plane2 city4 city0 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 19 of 25
61. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 19 of 25
62. (debark person11 plane2 city0)
   deleted: (in person11 plane2)
   added: (at person11 city0)
   goals met: 20 of 25
63. (fly plane2 city0 city7 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 20 of 25
64. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 20 of 25
65. (debark person5 plane2 city7)
   deleted: (in person5 plane2)
   added: (at person5 city7)
   goals met: 21 of 25
66. (fly plane2 city7 city8 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 21 of 25
67. (debark person9 plane2 city8)
   deleted: (in person9 plane2)
   added: (at person9 city8)
   goals met: 22 of 25
68. (fly plane6 city7 city1 fl1 fl0)
   deleted: (at plane6 city7) (fuel-level plane6 fl1)
   added: (at plane6 city1) (fuel-level plane6 fl0)
   goals met: 21 of 25
69. (refuel plane6 city1 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 21 of 25
70. (debark person4 plane6 city1)
   deleted: (in person4 plane6)
   added: (at person4 city1)
   goals met: 22 of 25
71. (fly plane6 city1 city8 fl1 fl0)
   deleted: (at plane6 city1) (fuel-level plane6 fl1)
   added: (at plane6 city8) (fuel-level plane6 fl0)
   goals met: 22 of 25
72. (refuel plane6 city8 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 22 of 25
73. (debark person17 plane6 city8)
   deleted: (in person17 plane6)
   added: (at person17 city8)
   goals met: 23 of 25
74. (fly plane6 city8 city9 fl1 fl0)
   deleted: (at plane6 city8) (fuel-level plane6 fl1)
   added: (at plane6 city9) (fuel-level plane6 fl0)
   goals met: 23 of 25
75. (refuel plane6 city9 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 23 of 25
76. (debark person2 plane6 city9)
   deleted: (in person2 plane6)
   added: (at person2 city9)
   goals met: 24 of 25
77. (fly plane6 city9 city7 fl1 fl0)
   deleted: (at plane6 city9) (fuel-level plane6 fl1)
   added: (at plane6 city7) (fuel-level plane6 fl0)
   goals met: 25 of 25
